Revit 2024 API
Curve Class
A parametric curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class Curve : GeometryObject
Visual Basic
Public Class Curve _
	Inherits GeometryObject
Visual C++
public ref class Curve : public GeometryObject
Remarks
The concrete curves are defined by parametric equations. If the curve is bound, it is only defined for an interval in parameterization. Otherwise, it is defined for all values of the parameter.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Curve
 Autodesk.Revit.DB.Arc
 Autodesk.Revit.DB.CylindricalHelix
 Autodesk.Revit.DB.Ellipse
 Autodesk.Revit.DB.HermiteSpline
 Autodesk.Revit.DB.Line
 Autodesk.Revit.DB.NurbSpline
See Also
Curve Members
Autodesk.Revit.DB Namespace